## Installing prereqs - order matters in this section!
brew "openjdk"

## Installing packages via brew
brew "ack"
brew "colordiff"
brew "dockutil"
brew "git"
brew "go"
brew "jq"
brew "maven"
brew "netcat"
brew "nmap"
brew "pandoc"
brew "pssh"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
brew "stow"
brew "tmux"
brew "watch"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

## Installing applications via cask
cask "1password"
cask "acorn"
cask "atom"
cask "audio-hijack"
cask "google-chrome"
cask "iterm2"
cask "intellij-idea"
cask "istat-menus"
cask "launchbar"
cask "little-snitch"
cask "mimestream"
cask "obsidian"
cask "omnifocus"
cask "vagrant"
cask "vimr"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

## Installations from the App Store
#mas "Logic Pro X", id: 634148309
#mas "Marked", id: 448925439
#mas "Microsoft Remote Desktop", id: 715768417
#mas "Numbers", id: 409203825
#mas "Pages", id: 409201541
mas "Drafts", id: 1435957248
#mas "Marked 2", id: 890031187
mas "Slack", id: 803453959
