## Installing prereqs - order matters in this section!
cask "java"

## Installing packages via brew
brew "ack"
brew "colordiff"
brew "dockutil"
brew "git"
brew "go"
brew "hg"
brew "jq"
brew "maven"
brew "netcat"
brew "nmap"
brew "pandoc"
brew "pssh"
brew "python"
brew "python3"
brew "stow"
brew "tmux"
brew "watch"
brew "zsh"
brew "zsh-completions"

## Installing applications via cask
cask "1password"
cask "acorn"
cask "atom"
cask "audio-hijack"
cask "crashplan"
cask "dropbox"
cask "firefox"
cask "google-chrome"
cask "handbrake"
cask "iterm2"
cask "intellij-idea"
cask "launchbar"
cask "little-snitch"
cask "omnigraffle5"
cask "macvim"
cask "pandora"
cask "skype"
cask "transmit"
cask "vagrant"
cask "vimr"
cask "virtualbox"
cask "viscosity"
cask "vlc"
cask "wkhtmltopdf"

## Installations from the App Store
mas "Airmail 3", id: 918858936
mas "Logic Pro X", id: 634148309
mas "Marked", id: 448925439
mas "Microsoft Remote Desktop", id: 715768417
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Quiver", id: 866773894
